---
kind: enumMember
id: F:Autodesk.Revit.DB.FormatStatus.Mixed
enum: Autodesk.Revit.DB.FormatStatus
source: html/81333f80-2181-8faa-9c1e-cadcda7f3b5e.htm
---
# Autodesk.Revit.DB.FormatStatus.Mixed

The characters in the format have mixed formatting.